foam-volume/OpenFOAM/openfoam-v2506/run/h42_sparse/constant/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40788
(
-0.0996528
-0.0956498
-0.0916957
-0.08779
-0.083932
-0.0801211
-0.0763569
-0.0726386
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
132
(
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
-0.101667
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
132
(
0.508313
0.508313
0.508313
0.508313
0.508313
0.508313
0.508313
0.508313
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
309
(
-0.0996528
-0.0956498
-0.0916957
-0.08779
-0.083932
-0.0801211
-0.0763569
-0.0726386
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
309
(
-0.0996528
-0.0956498
-0.0916957
-0.08779
-0.083932
-0.0801211
-0.0763569
-0.0726386
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
