foam-volume/OpenFOAM/openfoam-v2506/run/h42_sparse/constant/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
40788
(
3.17389e-05
3.17389e-05
3.17389e-05
3.17389e-05
3.17389e-05
3.17389e-05
3.17389e-05
3.17389e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
132
(
3.17389e-05
9.62964e-05
0.00016305
0.000232074
0.000303446
0.000377246
0.000453557
0.000532463
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
132
(
3.17389e-05
9.62964e-05
0.00016305
0.000232074
0.000303446
0.000377246
0.000453557
0.000532463
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
309
(
0
0
0
0
0
0
0
0
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
309
(
0.1525
0.1525
0.1525
0.1525
0.1525
0.1525
0.1525
0.1525
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
