foam-volume/OpenFOAM/openfoam-v2506/run/h42_sparse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          132;
        startFace       81135;
    }
    outlet
    {
        type            patch;
        nFaces          132;
        startFace       81267;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          309;
        startFace       81399;
    }
    top
    {
        type            patch;
        nFaces          309;
        startFace       81708;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          81576;
        startFace       82017;
    }
)

// ************************************************************************* //
