foam-volume/OpenFOAM/openfoam-v2506/run/h42_sparse/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.10166666 0 0)    			// 0
    (0 0 0)     					// 1
    (0.025417 0.003748454 0)     	// 2
    (0.279583 0.003748454 0)     	// 3
    (0.305 0 0)     				// 4
    (0.508313 0 0)     				// 5

    (-0.10166666 .1525 0)    		// 6
    (0 .1525 0)     				// 7
    (0.025417 .1525 0)     			// 8
    (0.279583 .1525 0)     			// 9
    (0.305 .1525 0)     			// 10
    (0.508313 .1525 0)     			// 11

    (-0.10166666 0 .05)    			// 12
    (0 0 .05)     					// 13
    (0.025417 0.003748454 .05)     	// 14
    (0.279583 0.003748454 .05)     	// 15
    (0.305 0 .05)     				// 16
    (0.508313 0 .05)     			// 17

    (-0.10166666 .1525 .05)    		// 18
    (0 .1525 .05)     				// 19
    (0.025417 .1525 .05)     		// 20
    (0.279583 .1525 .05)     		// 21
    (0.305 .1525 .05)     			// 22
    (0.508313 .1525 .05)     		// 23
);

blocks
(
    hex (0 1 7 6 12 13 19 18) (30 132 1) simpleGrading (.7 80 1) 
    hex (1 2 8 7 13 14 20 19) (9 132 1) simpleGrading (1 80 1) 
    hex (2 3 9 8 14 15 21 20) (150 132 1) simpleGrading (.3 80 1) 
    hex (3 4 10 9 15 16 22 21) (30 132 1) simpleGrading (1 80 1) 
    hex (4 5 11 10 16 17 23 22) (90 132 1) simpleGrading (6 80 1) 
);

edges
(
	arc 1 2 (0.012708333 0.00082312 0)
	arc 13 14 (0.012708333 0.00082312 .05)

	arc 2 3 (0.1525 0.042 0) 					//Change to vary bump size
	arc 14 15 (0.1525 0.042 .05)				//Change to vary bump size

	arc 3 4 (0.292291667 0.00082312 0)
	arc 15 16 (0.292291667 0.00082312 .05)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 12 18)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 11 17 23)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 12 13)
            (1 2 13 14)
            (2 3 14 15)
            (3 4 15 16)
            (4 5 16 17)
        );
    }
    top
    {
        type patch;
        faces
        (
            (6 7 18 19)
            (7 8 19 20)
            (8 9 20 21)
            (9 10 21 22)
            (10 11 22 23)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
			(0 1 7 6)
			(12 13 19 18)
			(1 2 8 7)
			(13 14 20 19)
			(2 3 9 8)
			(14 15 21 20)
			(3 4 10 9)
			(15 16 22 21)
			(4 5 11 10)
			(16 17 23 22)
        );
    }
);

// ************************************************************************* //
